<html><head><meta content="text/html; charset=UTF-8" http-equiv="content-type"><style type="text/css">@import url('https://themes.googleusercontent.com/fonts/css?kit=cGvuclDC_Z1vE_cnVEU6Ae_NZQ7StBcqH_vXVqoPMX0');ol{margin:0;padding:0}table td,table th{padding:0}.c21{border-right-style:solid;padding:5pt 5pt 5pt 5pt;border-bottom-color:#980000;border-top-width:2.2pt;border-right-width:2.2pt;border-left-color:#980000;vertical-align:middle;border-right-color:#980000;border-left-width:2.2pt;border-top-style:solid;background-color:#ffffff;border-left-style:solid;border-bottom-width:2.2pt;width:703.5pt;border-top-color:#980000;border-bottom-style:solid}.c14{padding-top:0pt;padding-bottom:0pt;line-height:1.15;orphans:2;widows:2;text-align:left;height:11pt}.c3{margin-left:108pt;padding-top:0pt;padding-bottom:0pt;line-height:1.15;orphans:2;widows:2;text-align:left}.c11{padding-top:0pt;padding-bottom:0pt;line-height:1.5;orphans:2;widows:2;text-align:left;height:11pt}.c1{color:#38761d;font-weight:400;text-decoration:none;vertical-align:baseline;font-size:14pt;font-family:"Arial";font-style:normal}.c6{margin-left:36pt;padding-top:0pt;padding-bottom:0pt;line-height:1.15;orphans:2;widows:2;text-align:left}.c5{color:#000000;font-weight:400;text-decoration:none;vertical-align:baseline;font-size:11pt;font-family:"Arial";font-style:normal}.c2{color:#000000;font-weight:400;text-decoration:none;vertical-align:baseline;font-size:18pt;font-family:"Arial";font-style:normal}.c23{padding-top:0pt;padding-bottom:0pt;line-height:1.1079545454545454;orphans:2;widows:2;text-align:left}.c12{padding-top:0pt;padding-bottom:0pt;line-height:1.5;orphans:2;widows:2;text-align:left}.c4{font-size:10pt;font-family:"Consolas";color:#666666;font-weight:400}.c10{color:#000000;font-weight:400;font-size:10pt;font-family:"Consolas"}.c19{color:#783f04;font-weight:700;font-size:18pt;font-family:"Arial"}.c17{color:#741b47;font-weight:400;font-size:11pt;font-family:"Arial"}.c8{font-size:10pt;font-family:"Consolas";color:#b00040;font-weight:400}.c0{font-size:10pt;font-family:"Consolas";color:#008000;font-weight:700}.c18{margin-left:126pt;border-spacing:0;border-collapse:collapse;margin-right:auto}.c16{color:#000000;font-weight:700;font-size:16pt;font-family:"Arial"}.c9{text-decoration:none;vertical-align:baseline;font-style:normal}.c13{font-size:10pt;font-family:"Consolas";font-weight:400}.c7{background-color:#f3f3f3;max-width:813.5pt;padding:14.2pt 14.2pt 14.2pt 14.2pt}.c25{font-style:italic;color:#408080}.c24{margin-left:144pt;height:11pt}.c20{height:0pt}.c15{margin-left:36pt}.c22{color:#b45f06}.title{padding-top:0pt;color:#000000;font-size:26pt;padding-bottom:3pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}.subtitle{padding-top:0pt;color:#666666;font-size:15pt;padding-bottom:16pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}li{color:#000000;font-size:11pt;font-family:"Arial"}p{margin:0;color:#000000;font-size:11pt;font-family:"Arial"}h1{padding-top:20pt;color:#000000;font-size:20pt;padding-bottom:6pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h2{padding-top:18pt;color:#000000;font-size:16pt;padding-bottom:6pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h3{padding-top:16pt;color:#434343;font-size:14pt;padding-bottom:4pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h4{padding-top:14pt;color:#666666;font-size:12pt;padding-bottom:4pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h5{padding-top:12pt;color:#666666;font-size:11pt;padding-bottom:4pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h6{padding-top:12pt;color:#666666;font-size:11pt;padding-bottom:4pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;font-style:italic;orphans:2;widows:2;text-align:left}</style></head><body class="c7"><p class="c12"><span class="c9 c19">&#27231;&#29575;&#25512;&#29702; (Probabilistic Reasoning)</span></p><p class="c11"><span class="c2"></span></p><p class="c12"><span class="c5">&#35201;&#36948;&#25104;&#29702;&#24615;&#30340;&#27770;&#31574;&#65292;&#25105;&#20497;&#38656;&#35201;&#36969;&#30070;&#30340;&#25512;&#29702;&#20358;&#34389;&#29702;&#19981;&#30906;&#23450;&#24615;&#20197;&#21450;&#25152;&#35373;&#23450;&#30340;&#21839;&#38988;&#30446;&#27161;&#12290;&#22312;&#33021;&#21147;&#19978;&#25105;&#20497;&#32317;&#26159;&#36973;&#36935;&#23526;&#21209;&#19978;&#30340;&#22256;&#38627;&#20197;&#21450;&#29702;&#35542;&#38480;&#21046;&#65292;&#36889;&#37117;&#26159;&#29986;&#29983;&#19981;&#30906;&#23450;&#24615;&#30340;&#20358;&#28304;&#65292;&#20006;&#19988;&#24433;&#38911;&#25105;&#20497;&#23565;&#29305;&#23450;&#20107;&#20214;&#30340;&#38928;&#28204;&#12290;</span></p><p class="c11"><span class="c5"></span></p><p class="c12"><span class="c5">&#21069;&#35328;&#30340;&#37096;&#20998;&#26410;&#23436;&#25104;&#65292;&#24453;&#32396;......</span></p><p class="c11"><span class="c5"></span></p><p class="c12"><span class="c9 c16">&#31532;&#20108;&#31456; &#32113;&#35336;&#34920;&#36948; (Representation)</span></p><p class="c12"><span class="c1">2.1&#31456; &#20449;&#24230;&#33287;&#27231;&#29575; (2.1 Degrees of Belief and Probability)</span></p><p class="c11"><span class="c5"></span></p><p class="c12"><span class="c5">&#30070;&#25152;&#34389;&#29702;&#30340;&#21839;&#38988;&#20855;&#26377;&#19981;&#30906;&#23450;&#24615;&#26178;&#65292;&#27604;&#36611;&#19981;&#21516;&#30340;&#21839;&#38988;&#38515;&#36848;&#20197;&#21450;&#25152;&#30456;&#38364;&#30340;&#21487;&#33021;&#24615;&#65292;&#26159;&#38750;&#24120;&#37325;&#35201;&#30340;&#26041;&#27861;&#12290;&#25105;&#20497;&#38656;&#35201;&#24977;&#34249;&#33879;&#21487;&#33021;&#24615;&#27604;&#36611;&#19981;&#21516;&#30340;&#38515;&#36848;&#20363;&#22914;: &#33287;&#38515;&#36848;B&#27604;&#36215;&#20358;&#65292;&#38515;&#36848;A&#20855;&#26377;&#36611;&#39640;&#30340;&#21487;&#33021;&#24615;&#12290; &#38515;&#36848;A&#33509;&#28858;&#26576;&#25944;&#36848;:&#12300;&#25105;&#30340;&#39493;&#21205;&#22120;&#25925;&#38556;&#12301;&#65292;&#32780;&#38515;&#36848;B&#28858;&#21478;&#19968;&#25944;&#36848;:&#12300;&#25105;&#30340;&#24863;&#28204;&#22120;&#25925;&#38556;&#12301;&#12290;&#37027;&#40636;&#22522;&#26044;&#21487;&#33021;&#33021;&#24615;&#20998;&#26512;&#30340;&#32080;&#35542;&#65292;&#25105;&#20497;&#23601;&#21487;&#20197;&#23531;&#19979;&#19968;&#20491;&#25551;&#36848;&#21487;&#33021;&#24615;&#30340;&#34920;&#36948;&#24335;&#21363;:</span></p><p class="c11"><span class="c5"></span></p><p class="c12"><span class="c5">A&gt;B</span></p><p class="c12"><span class="c5">P(A)&gt;P(B) &#31561;&#20729;&#26044;(&#33509;&#19988;&#21807;&#33509;) A&gt;B</span></p><p class="c12"><span class="c5">P(A)=P(B) &#31561;&#20729;&#26044;(&#33509;&#19988;&#21807;&#33509;) A~B</span></p><p class="c11"><span class="c5"></span></p><p class="c12"><span class="c5">&#33509;&#25105;&#20497;&#23565;&#24050;&#32147;&#24314;&#31435;&#30340;&#12300;&#21487;&#33021;&#24615;&#34920;&#36948;&#24335;&#12301;&#20013;&#30340;&#27231;&#29575;P&#20855;&#26377;&#32113;&#35336;&#19978;&#30340;&#21069;&#25552;&#20551;&#35373;(&#20363;&#22914;:&#20808;&#39511;&#30693;&#35672;)&#65292;&#37027;&#40636;&#23601;&#24517;&#38920;&#31526;&#21512;&#22522;&#26412;&#30340;&#32113;&#35336;&#20844;&#29702;&#12290;&#20363;&#22914;&#65292;&#30070;&#25105;&#20497;&#24050;&#32147;&#30906;&#23450;&#20107;&#20214;A&#26371;&#30332;&#29983;&#65292;&#37027;&#40636; P(A)&#30340;&#27231;&#29575;&#20540;&#23601;&#24517;&#28982;&#31561;&#26044;&#19968;&#65292;&#33509;&#25105;&#20497;&#30456;&#20449;&#20107;&#20214;A&#26159;&#19981;&#21487;&#33021;&#30332;&#29983;&#30340;&#65292;&#21063; P(A)&#21363;&#28858;&#38646;&#12290;&#25152;&#35586;A&#30340;&#12300;&#19981;&#30906;&#23450;&#24615;&#12301;&#33509;&#35201;&#29992;&#19968;&#20491;&#25976;&#20540;&#34920;&#36948;&#65292;&#23601;&#26159;&#20171;&#26044;&#38646;&#33287;&#19968;&#36889;&#20841;&#20491;&#26997;&#31471;&#20043;&#38291;&#30340;&#20540;&#12290;</span></p><p class="c11"><span class="c5"></span></p><p class="c12"><span class="c1">2.2&#31456; &#27231;&#29575;&#20998;&#24067; (2.2 Probability Distributions)</span></p><p class="c12"><span class="c5">&#25551;&#36848;&#21508;&#31278;&#19981;&#21516;&#20107;&#20214;&#30340;&#30332;&#29983;&#27231;&#29575;&#65292;&#25105;&#20497;&#31281;&#20043;&#28858;&#27231;&#29575;&#20998;&#24067;&#12290;&#27231;&#29575;&#20998;&#24067;&#26377;&#24456;&#22810;&#31278;&#24418;&#24335;&#65292;&#22522;&#26044;&#21487;&#33021;&#30332;&#29983;&#20107;&#20214;&#30340;&#22411;&#24907;&#31278;&#39006;&#21487;&#20197;&#20998;&#25104;&#20841;&#22823;&#39006;: &#38626;&#25955;&#20197;&#21450;&#36899;&#32396;&#27231;&#29575;&#20998;&#24067;&#12290;</span></p><p class="c12"><span class="c5">(&#35695;&#32773;: &#33289;&#20363;&#65292;&#29992;&#20358;&#25551;&#36848;&#26126;&#26085;&#22825;&#27683;&#27231;&#29575;&#65292;&#22240;&#28858;&#21482;&#26377;&#19977;&#31278;&#21487;&#33021;:&#26228;&#12289;&#38632;&#25110;&#26159;&#38512;&#22825;&#12290;&#21482;&#26377;&#36889;&#19977;&#31278;&#38626;&#25955;&#30340;&#29376;&#24907;&#65292;&#25925;&#25551;&#36848;&#20854;&#27231;&#29575;&#31281;&#20043;&#28858;&#38626;&#25955;&#27231;&#29575;&#20998;&#24067;&#12290;&#20294;&#21478;&#33289;&#19968;&#20363;&#65292;&#22914;&#26524;&#25551;&#36848;&#30340;&#26159;&#26126;&#26085;&#30340;&#21487;&#33021;&#27683;&#28331;&#65292;&#30001;&#26044;&#27683;&#28331;&#20540;&#26159;&#36899;&#32396;&#65292;&#25925;&#25551;&#36848;&#21487;&#33021;&#30340;&#27683;&#28331;&#20998;&#24067;&#23601;&#26371;&#26159;&#36899;&#32396;&#27231;&#29575;&#20998;&#24067;)</span></p><p class="c11"><span class="c5"></span></p><p class="c12"><span>&nbsp;</span><span class="c22">&nbsp;</span><span class="c9 c17">2.2.1&#31456; &#38626;&#25955;&#32113;&#35336;&#20998;&#24067; (2.2.1 Discrete Probability Distributions)</span></p><p class="c12"><span class="c5">&#23565;&#19968;&#31995;&#21015;&#38750;&#36899;&#32396;&#20107;&#20214;(&#38626;&#25955;&#38568;&#27231;&#35722;&#25976;)&#30340;&#27231;&#29575;&#25551;&#36848;&#65292;&#31281;&#20043;&#28858;&#38626;&#25955;&#27231;&#29575;&#20998;&#24067;&#12290;&#22312;&#27231;&#29575;&#35542;&#20013;&#65292;&#27231;&#29575;&#36074;&#37327;&#20989;&#25976;&#65288;probability mass function&#65289;&#21363;&#26159;&#29992;&#20358;&#34920;&#36948;&#21508;&#20107;&#20214;&#30340;&#30332;&#29983;&#27231;&#29575;&#20540;&#12290; &#36914;&#19968;&#27493;&#33289;&#20363;: &#20551;&#22914;&#65292;&#25105;&#20497;&#26377;&#19968;&#20491;&#38568;&#27231;&#35722;&#25976;X&#65292;&#36889;&#20491;&#35722;&#25976;&#30340;&#20540;&#65292;&#27599;&#19968;&#27425;&#37117;&#26377;&#21487;&#33021;&#26159;n&#20491;(&#26377;&#38480;&#20491;)&#25976;&#20013;&#30340;&#20854;&#20013;&#19968;&#20491;&#12290;(1~n &#20491;&#25976;&#20540;&#20013;&#30340;&#20854;&#20013;&#19968;&#20491;&#65292;&#25105;&#20497;&#29992;&#27161;&#40670;&#31526;&#34399;(&#20882;&#34399;)&#12300;:&#12301;&#20358;&#25551;&#36848;&#36889;&#20491;&#25976;&#20540;&#28085;&#33995;&#30340;&#31684;&#22285;&#21363; 1:n ) &#35387;1. &#25105;&#20497;&#29992;P(X=1)&#12289;P(X=2)&#12289;P(X=3)&#12289;&#12289;&#12289;&#12289;&#12289;P(X=n)&#20358;&#34920;&#36948;X&#21487;&#33021;&#26159;&#26576;&#19968;&#29305;&#23450;&#20540;&#30340;&#27231;&#29575;&#65292;</span></p><p class="c11"><span class="c5"></span></p><p class="c12"><span class="c5">&#22312;&#36889;&#35041;&#25105;&#20497;&#21487;&#20197;&#29992;&#19978;&#31532;&#19968;&#20491;&#32113;&#35336;&#22522;&#26412;&#20844;&#29702;&#65292;&#36889;&#20491;&#20844;&#29702;&#38480;&#21046;&#20303;&#25152;&#26377;&#20107;&#20214;&#27231;&#29575;&#30340;&#32317;&#21644;&#24517;&#38920;&#28858;&#19968;&#12290;&#32780;&#20219;&#19968;&#20491;&#29305;&#23450;&#20107;&#20214;&#30340;&#27231;&#29575;&#20540;&#65292;&#24517;&#23450;&#20171;&#26044;&#12300;&#22823;&#26044;&#31561;&#26044;&#38646;&#12301;&#20197;&#21450;&#12300;&#23567;&#26044;&#31561;&#26044;&#19968;&#12301;&#36889;&#20491;&#25976;&#20540;&#31684;&#22285;&#20839;&#12290;</span></p><p class="c11"><span class="c5"></span></p><p class="c12"><span class="c5">&sum; P(X = i) = 1 i=1</span></p><p class="c11"><span class="c5"></span></p><p class="c11"><span class="c5"></span></p><p class="c11"><span class="c5"></span></p><p class="c12"><span class="c5">&#35387;1:&#28858;&#20102;&#31777;&#21270;&#22240;&#27492;&#32147;&#24120;&#20197;&#27161;&#40670;&#31526;&#34399;&#20882;&#34399;&#20358;&#25551;&#36848;&#25976;&#20540;&#31684;&#22285;&#65292;&#20063;&#26377;&#20154;&#20351;&#29992;&#27604;&#36611;&#32321;&#29795;&#30340;&#34920;&#36948;&#26041;&#24335;&#22914;[1..n]&#12290;&#30070;&#25105;&#20497;&#34389;&#29702;&#21521;&#37327;&#26178;&#65292;&#20063;&#32147;&#24120;&#29992;[a:b]=[a-th elements : b-th elements]&#25110;&#32773;&#34389;&#29702;&#30697;&#38499;&#26178;&#20197; [a:b]=[row-th number : coulmn-th number]&#20358;&#23565;&#21521;&#37327;&#12289;&#30697;&#38499;&#30340;&#20803;&#32032;&#36914;&#34892;&#32034;&#24341;&#12290;(&#36889;&#19968;&#39006;&#30340;&#24120;&#35211;&#34920;&#36948;&#32722;&#24931;&#65292;&#26377;&#26178;&#34987;&#36939;&#31639;&#39006;&#30340;&#31243;&#24335;&#35486;&#35328;&#32380;&#25215;&#22914;: Julia and MATLAB)</span></p><p class="c11"><span class="c5"></span></p><p class="c12"><span>&nbsp; </span><span class="c17 c9">2.2.2&#31456; &#36899;&#32396;&#32113;&#35336;&#20998;&#24067; (2.2.2 Continuous Probability Distributions)</span></p><p class="c11"><span class="c5"></span></p><p class="c12"><span class="c1">2.3&#31456; &#32879;&#21512;&#27231;&#29575;&#20998;&#24067; (2.3 Joint Distributions)</span></p><p class="c12"><span class="c5">&#34389;&#29702;&#21934;&#19968;&#38568;&#27231;&#35722;&#25976;&#30340;&#27231;&#29575;&#20998;&#24067;&#65292;&#25105;&#20497;&#31281;&#28858;&#21934;&#35722;&#25976;&#27231;&#29575;&#20998;&#24067;&#12290;&#30070;&#25105;&#20497;&#30340;&#21839;&#38988;&#29309;&#28041;&#21040;&#22810;&#20491;&#38568;&#27231;&#35722;&#25976;&#26178;&#65292;&#38656;&#35201;&#36879;&#36942;&#32879;&#21512;&#27231;&#29575;&#20998;&#24067;&#34920;&#36948;&#22810;&#20491;&#38568;&#27231;&#35722;&#25976;&#30340;&#27231;&#29575;&#20540;&#12290;&#32879;&#21512;&#27231;&#29575;&#20998;&#24067;&#26159;&#19968;&#31278;&#22810;&#35722;&#25976;&#27231;&#29575;&#20998;&#24067;&#12290; &#33289;&#20363;&#65292;&#26377;&#20841;&#20491;&#38626;&#31639;&#30340;&#38568;&#27231;&#35722;&#25976;&#20998;&#21029;&#28858; X &#21450; Y&#65292;&#20854;&#32879;&#21512;&#27231;&#29575;&#20998;&#24067;&#34920;&#36948;&#28858;P(X&#65292;Y)&#12290;&#30070;X=Xa&#12289;Y=Yb&#65292;&#21063;P(Xa&#65292;Yb)&#28858;&#36889;&#20841;&#20491;&#29305;&#23450;&#20540;&#21516;&#26178;&#20986;&#29694;&#30340;&#27231;&#29575;&#12290; &#26681;&#25818;&#19968;&#20491;&#24050;&#30693;&#30340;&#32879;&#21512;&#27231;&#29575;&#20998;&#24067;&#65292;&#25105;&#20497;&#21487;&#20197;&#35336;&#31639;&#20854;&#37002;&#38555;&#27231;&#29575;&#20998;&#24067;(marginal distribution)&#12290;&#35336;&#31639;&#26041;&#24335;&#65292;&#26159;&#23559;&#32879;&#21512;&#27231;&#29575;&#20998;&#24067;&#30340;&#20854;&#20182;&#35722;&#25976;&#30332;&#29983;&#21487;&#33021;&#32317;&#21644;&#65292;&#20677;&#30041;&#19979;&#21934;&#19968;&#35722;&#25976;&#65292;&#27492;&#21934;&#19968;&#35722;&#25976;&#21363;&#28858;&#35442;&#32879;&#21512;&#27231;&#29575;&#23565;&#27425;&#29305;&#23450;&#35722;&#25976;&#30340;&#37002;&#38555;&#27231;&#29575;&#20998;&#24067;&#65292;&#36889;&#20491;&#29305;&#24615;&#21448;&#31281;&#28858;&#20840;&#27231;&#29575;&#27861;&#21063;(law of total probability:) P(x) = &sum;P(x, y) &#35531;&#35712;&#32773;&#29305;&#21029;&#27880;&#24847;&#65292;&#36889;&#20491;&#22522;&#26412;&#35264;&#24565;&#22312;&#24448;&#24460;&#23559;&#26371;&#36011;&#31359;&#26412;&#26360;&#12290;</span></p><p class="c12"><span class="c5">&#30495;&#23526;&#19990;&#30028;&#20013;&#30340;&#21839;&#38988;&#24448;&#24448;&#29309;&#28041;&#21040;&#22810;&#20491;&#35722;&#25976;&#65292;&#36889;&#20123;&#35722;&#25976;&#20043;&#38291;&#24444;&#27492;&#38364;&#20418;&#21487;&#33021;&#24456;&#35079;&#38620;&#65292;&#22240;&#27492;&#24605;&#32771;&#20854;&#27770;&#31574;&#36942;&#31243;&#65292;&#36890;&#24120;&#38656;&#35201;&#26681;&#25818;&#20854;&#32879;&#21512;&#27231;&#29575;&#20998;&#24067;&#36914;&#34892;&#36969;&#30070;&#25512;&#29702;&#12290;&#32780;&#32879;&#21512;&#27231;&#29575;&#20998;&#24067;&#65292;&#22823;&#25269;&#19978;&#20063;&#26681;&#25818;&#20854;&#35722;&#25976;&#30340;&#36899;&#32396;&#25110;&#38626;&#25955;&#24615;&#32780;&#34987;&#20998;&#28858;&#27492;&#20841;&#22823;&#39006;&#12290;</span></p><p class="c11"><span class="c5"></span></p><p class="c12"><span>&nbsp; </span><span class="c17 c9">2.3.1&#31456; &#38626;&#25955;&#32879;&#21512;&#20998;&#24067; (2.3.1 Discrete Joint Distributions)</span></p><p class="c12"><span class="c5">&#22914;&#26524;&#38568;&#27231;&#35722;&#25976;&#37117;&#26159;&#38626;&#25955;&#30340;&#65292;&#37027;&#40636;&#20854;&#32879;&#21512;&#27231;&#29575;&#20998;&#24067;&#21487;&#20197;&#34987;&#34920;&#31034;&#25104;&#34920;&#26684;(table)&#65292;&#39006;&#20284;&#19979;&#26041;&#30340;&#34920;2.1&#12290;&#36889;&#20491;&#34920;&#26684;&#65292;&#21015;&#20986;&#25152;&#26377;&#38568;&#27231;&#35722;&#25976;(X&#12289;Y&#12289;Z)&#26377;&#21487;&#33021;&#30332;&#29983;&#30340;&#20540;&#65292;&#25152;&#26377;&#21487;&#33021;&#30340;&#24773;&#27841;&#37117;&#34987;&#21253;&#21547;&#22312;&#36889;&#20491;&#34920;&#26684;&#20839;&#65292;&#20854;&#20013;&#26368;&#21491;&#37002;&#30340;&#19968;&#20491;&#27396;&#20301;&#21015;&#20986;&#25152;&#26377;&#21487;&#33021;&#30456;&#23565;&#25033;&#30340;&#27231;&#29575;&#20540;&#12290;&#22312;&#36889;&#20491;&#20363;&#23376;&#20013;&#65292;&#19977;&#20491;&#35722;&#25976;(X&#12289;Y&#12289;Z)&#30340;&#20540;&#26377;&#21487;&#33021;&#26159; 0 &#25110;&#32773; 1&#65292;&#27599;&#20491;&#38568;&#27231;&#35722;&#25976;&#37117;&#21482;&#26377;&#20841;&#31278;&#21487;&#33021;&#30340;&#29376;&#24907;&#65292;&#22240;&#27492;&#32317;&#20849;&#26371;&#26377;2^3=8&#31278;&#21487;&#33021;&#30340;&#32080;&#26524;&#12290; &#30001;&#26044;&#36889;&#27171;&#30340;&#34920;&#26684;&#24050;&#32147;&#32645;&#21015;&#20986;&#25152;&#26377;&#21487;&#33021;&#65292;&#22240;&#27492;&#33509;&#21152;&#32317;&#26368;&#21491;&#20596;&#27396;&#20301;&#30340;&#25152;&#26377;&#27231;&#29575;&#20540;&#65292;&#20854;&#32317;&#21644;&#24517;&#38920;&#31561;&#26044;&#19968;&#12290;&#20063;&#22240;&#28858;&#26377;&#36889;&#20491;&#22522;&#26412;&#30340;&#32113;&#35336;&#20844;&#29702;&#23384;&#22312;&#65292;&#22240;&#27492;&#25105;&#20497;&#21482;&#38656;&#35201;&#19971;&#20491;&#21443;&#25976;()&#20358;&#25551;&#36848;&#36889;&#20491;&#34920;&#26684;&#30340;&#27231;&#29575;&#20540;&#65292;&#25563;&#21477;&#35441;&#35498;&#65292;&#22240;&#28858;&#26681;&#25818;&#36889;&#20491;&#32113;&#35336;&#20844;&#29702;&#65292;&#25152;&#26377;&#27231;&#29575;&#20540;&#32317;&#21644;&#24517;&#38920;&#28858;&#19968;&#65292;&#22240;&#27492;&#31532;&#20843;&#20491;&#27231;&#29575;&#20540;&#24517;&#23450;&#28858; 1-(&#20854;&#20182;&#19971;&#20491;&#27231;&#29575;&#20540;&#30340;&#32317;&#21644;)&#12290; &#21516;&#29702;&#21487;&#35657;&#65292;&#30070;&#25105;&#20497;&#26377;n &#20491;&#20108;&#20803;&#38568;&#27231;&#35722;&#25976;(&#20677;&#26377;&#38646;&#25110;&#19968;&#20841;&#31278;&#29376;&#24907;)&#65292;&#25105;&#20497;&#38656;&#35201;(2^n - 1)&#20491;&#21443;&#25976;&#20358;&#25551;&#36848;&#25152;&#26377;&#20107;&#20214;&#30340;&#27231;&#29575;&#20540;(&#20063;&#21487;&#20197;&#35498;&#26159;&#65292;&#25551;&#36848;&#25972;&#20491;&#32879;&#21512;&#27231;&#29575;&#20998;&#24067;)&#12290; &#30001;&#27492;&#21487;&#35211;&#65292;&#32879;&#21512;&#27231;&#29575;&#20998;&#24067;&#30340;&#21443;&#25976;&#37327;&#33287;&#35722;&#25976;&#30340;&#25976;&#30446;&#21576;&#29694;&#20906;&#20989;&#25976;&#38364;&#20418;&#12290;&#23526;&#21209;&#19978;&#65292;&#36889;&#26377;&#26178;&#36896;&#25104;&#32879;&#21512;&#27231;&#29575;&#20998;&#24067;&#22312;&#20786;&#23384;&#26178;&#36973;&#36935;&#35352;&#25014;&#39636;&#21839;&#38988;&#12290; &#26576;&#20123;&#29305;&#23450;&#30340;&#24773;&#27841;&#19979;&#65292;&#21839;&#38988;&#20801;&#35377;&#25105;&#20497;&#21487;&#20197;&#23559;&#20854;&#20013;&#30340;&#38568;&#27231;&#35722;&#25976;&#35222;&#20316;&#29544;&#31435;&#35722;&#25976;(independent)&#65292;&#25563;&#21477;&#35441;&#35498;&#65292;&#20219;&#20309;&#19968;&#20491;&#35722;&#25976;&#28961;&#27861;&#25552;&#20379;&#20219;&#20309;&#35338;&#24687;(&#32218;&#32034;&#12289;&#36039;&#35338;)&#35731;&#25105;&#20497;&#21028;&#26039;&#21478;&#19968;&#20491;&#35722;&#25976;&#21487;&#33021;&#30340;&#20540;&#12290;&#20063;&#21487;&#20197;&#29702;&#35299;&#25104;&#65292;&#20219;&#20309;&#19968;&#20491;&#35722;&#25976;&#30340;&#27231;&#29575;&#20998;&#24067;&#65292;&#37117;&#21644;&#21478;&#19968;&#20491;&#35722;&#25976;&#30340;&#20540;&#28961;&#38364;&#12290; &#20363;: &#33509;&#35722;&#25976;X&#21450;Y&#25142;&#28858;&#29544;&#31435;&#35722;&#25976;(independent)&#65292;&#37027;&#40636;&#22312;&#25972;&#20491;X&#12289;Y&#35722;&#25976;&#30340;&#20540;&#22495;&#35041;&#65292;&#20854;&#32879;&#21512;&#27231;&#29575;&#20998;&#24067;&#21487;&#20197;&#34920;&#31034;&#25104;: P(X,Y)=P(X)P(Y) (&#35695;: &#20854;&#32879;&#21512;&#27231;&#29575;&#20998;&#24067;&#65292;&#23601;&#21482;&#26159;&#20841;&#20491;&#35722;&#25976;&#30340;&#27231;&#29575;&#20998;&#24067;&#30456;&#20056;&#65292;X&#30340;&#27231;&#29575;&#20998;&#24067;&#21482;&#21644;X&#33258;&#24049;&#26377;&#38364;&#65292;Y&#34389;&#22312;&#20219;&#20309;&#30340;&#20540;&#37117;&#19981;&#26371;&#25913;&#35722;X&#30340;&#27231;&#29575;&#20998;&#24067;&#65292;&#21453;&#20043;&#20134;&#28982;&#12290;) &#21516;&#29702;&#21487;&#35657;&#65292;&#25512;&#24291;&#21040;n&#20491;&#35722;&#25976;(X1&#12289;X2&#12289;X3.....Xn)&#65292;&#33509;&#36889;n&#20491;&#35722;&#25976;&#24444;&#27492;&#37117;&#29544;&#31435;&#65292;&#21063;&#27492;n&#20491;&#35722;&#25976;&#30340;&#32879;&#21512;&#27231;&#29575;&#20998;&#24067;&#28858;: P(X1:n)=&prod;i P(xi).</span></p><p class="c12"><span class="c5">&#29544;&#31435;(independent)&#35722;&#25976;&#30340;&#29305;&#24615;&#65292;&#20351;&#25105;&#20497;&#21487;&#20197;&#29992;n&#20491;&#21443;&#25976;&#24418;&#23481;n&#20491;&#35722;&#25976;&#30340;&#32879;&#21512;&#27231;&#29575;&#20998;&#24067;&#65292;&#32780;&#38750;&#29992;(2^n-1)&#20491;&#21443;&#25976;&#12290;&#21482;&#26377;&#22312;&#35722;&#25976;&#24444;&#27492;&#20043;&#38291;&#20855;&#26377;&#38364;&#32879;&#24615;&#32780;&#19981;&#20114;&#30456;&#29544;&#31435;&#65292;&#25105;&#20497;&#25165;&#38656;&#35201;&#20351;&#29992;&#21040;2^n-1 &#20491;&#21443;&#25976;&#20358;&#25551;&#36848;&#32879;&#21512;&#27231;&#29575;&#20998;&#24067;&#12290; &#29544;&#31435;&#24615;&#21487;&#20197;&#28858;&#25105;&#20497;&#30340;&#21839;&#38988;&#24118;&#20358;&#39514;&#20154;&#30340;&#31777;&#21270;&#65292;&#20294;&#22312;&#34389;&#29702;&#23526;&#21209;&#21839;&#38988;&#26178;&#65292;&#25105;&#20497;&#24517;&#38920;&#24456;&#23567;&#24515;&#36889;&#20491;&#20551;&#35373;&#65292;&#22240;&#28858;&#23427;&#24448;&#24448;&#26159;&#37679;&#30340;&#12290;</span></p><p class="c12"><span>&#25105;&#20497;&#21487;&#20197;&#29992;&#22240;&#23376;(factor)&#20358;&#25551;&#36848;&#32879;&#21512;&#27231;&#29575;&#20998;&#24067;&#12290;&#21487;&#20197;&#21443;&#32771;&#24213;&#19979;2.1&#30340;&#31684;&#20363;&#31243;&#24335;&#30908;&#65292;</span><span class="c13">&#981;&#34987;&#23450;&#32681;&#28858;&#20855;&#26377;&#12300;&#22240;&#23376;&#12301;&#22411;&#21029;&#30340;&#35722;&#25976;&#38598;&#21512;&#65292;&#20006;&#19988;&#33021;&#36879;&#36942;assignments&#20989;&#24335;(function)&#28858;&#36889;&#20123;&#35722;&#25976;&#36070;&#20540;&#12290;&#36889;&#20123;&#36070;&#20104;&#35722;&#25976;&#30340;&#20540;&#21363;&#26159;&#25152;&#23565;&#25033;&#35722;&#25976;&#30340;&#27231;&#29575;&#65292;&#25925;&#36889;&#20123;&#20540;&#24517;&#38920;&#26159;&#27491;&#23526;&#25976;&#12290;&#24213;&#19979;&#30340;2.1&#31243;&#24335;&#30908;&#23601;&#26159;&#23526;&#29694;&#27492;&#35215;&#21063;&#30340;&#23526;&#20316;&#65292;&#25105;&#20497;&#23559;&#29992;&#31684;&#20363;2.3&#20358;&#23637;&#31034;&#23526;&#20316;&#30340;&#32048;&#31680;&#12290;</span></p><a id="t.4955c171c5125f72ee48cf7b9631c77c50c19446"></a><a id="t.0"></a><table class="c18"><tbody><tr class="c20"><td class="c21" colspan="1" rowspan="1"><p class="c6"><span class="c0">struct</span><span class="c13">&nbsp;</span><span class="c8">Variable</span></p><p class="c6"><span class="c13">&nbsp; &nbsp; &nbsp;name</span><span class="c4">::</span><span class="c8">Symbol</span></p><p class="c6"><span class="c13">&nbsp; &nbsp; &nbsp;m</span><span class="c4">::</span><span class="c8">Int</span><span class="c13">&nbsp;</span><span class="c13 c25"># number of possible values</span></p><p class="c6"><span class="c0">end</span></p><p class="c14 c15"><span class="c10 c9"></span></p><p class="c6"><span class="c0">const</span><span class="c13">&nbsp;Assignment </span><span class="c4">=</span><span class="c13">&nbsp;</span><span class="c8">Dict</span><span class="c13">{</span><span class="c8">Symbol</span><span class="c13">,</span><span class="c8">Int</span><span class="c10 c9">}</span></p><p class="c6"><span class="c0">const</span><span class="c13">&nbsp;FactorTable </span><span class="c4">=</span><span class="c13">&nbsp;</span><span class="c8">Dict</span><span class="c13">{</span><span class="c8">Assignment</span><span class="c13">,</span><span class="c8">Float64</span><span class="c9 c10">}</span></p><p class="c14 c15"><span class="c10 c9"></span></p><p class="c6"><span class="c0">struct</span><span class="c13">&nbsp;</span><span class="c8">Factor</span></p><p class="c6"><span class="c13">&nbsp; &nbsp; &nbsp;vars</span><span class="c4">::</span><span class="c8">Vector</span><span class="c13">{</span><span class="c8">Variable</span><span class="c10 c9">}</span></p><p class="c6"><span class="c13">&nbsp; &nbsp; &nbsp;table</span><span class="c4">::</span><span class="c8">FactorTable</span></p><p class="c6"><span class="c0">end</span></p><p class="c14 c15"><span class="c10 c9"></span></p><p class="c6"><span class="c13">variablenames(&#981;</span><span class="c4">::</span><span class="c8">Factor</span><span class="c13">) </span><span class="c4">=</span><span class="c13">&nbsp;[var</span><span class="c4">.</span><span class="c13">name </span><span class="c0">for</span><span class="c13">&nbsp;var </span><span class="c0">in</span><span class="c13">&nbsp;&#981;</span><span class="c4">.</span><span class="c10 c9">vars]</span></p><p class="c6"><span class="c13">select(a</span><span class="c4">::</span><span class="c8">Assignment</span><span class="c13">, varnames</span><span class="c4">::</span><span class="c8">Vector</span><span class="c13">{</span><span class="c8">Symbol</span><span class="c13">}) </span><span class="c4">=</span><span class="c13">&nbsp;Assignment(n</span><span class="c4">=&gt;</span><span class="c13">a[n] </span><span class="c0">for</span><span class="c13">&nbsp;n </span><span class="c0">in</span><span class="c10 c9">&nbsp;varnames)</span></p><p class="c14 c15"><span class="c10 c9"></span></p><p class="c6"><span class="c0">function</span><span class="c13">&nbsp;assignments(vars</span><span class="c4">::</span><span class="c8">AbstractVector</span><span class="c13">{</span><span class="c8">Variable</span><span class="c10 c9">})</span></p><p class="c6"><span class="c13">&nbsp; &nbsp; &nbsp; &nbsp; names </span><span class="c4">=</span><span class="c13">&nbsp;[var</span><span class="c4">.</span><span class="c13">name </span><span class="c0">for</span><span class="c13">&nbsp;var </span><span class="c0">in</span><span class="c10 c9">&nbsp;vars]</span></p><p class="c6"><span class="c13">&nbsp; &nbsp; &nbsp; &nbsp; </span><span class="c0">return</span><span class="c13">&nbsp;vec([Assignment(n</span><span class="c4">=&gt;</span><span class="c13">v </span><span class="c0">for</span><span class="c13">&nbsp;(n,v) </span><span class="c0">in</span><span class="c13">&nbsp;zip(names, values)) </span><span class="c0">for</span><span class="c13">&nbsp;values </span><span class="c0">in</span><span class="c13">&nbsp;product((</span><span class="c4">1:</span><span class="c13">v</span><span class="c4">.</span><span class="c13">m </span><span class="c0">for</span><span class="c13">&nbsp;v </span><span class="c0">in</span><span class="c13">&nbsp;vars)</span><span class="c4">...</span><span class="c10 c9">)])</span></p><p class="c6"><span class="c0">end</span></p><p class="c6"><span class="c10 c9">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;</span></p><p class="c6"><span class="c0">function</span><span class="c13">&nbsp;normalize!(&#981;</span><span class="c4">::</span><span class="c8">Factor</span><span class="c10 c9">)</span></p><p class="c6"><span class="c13">&nbsp; &nbsp; &nbsp; &nbsp; z </span><span class="c4">=</span><span class="c13">&nbsp;sum(p </span><span class="c0">for</span><span class="c13">&nbsp;(a,p) </span><span class="c0">in</span><span class="c13">&nbsp;&#981;</span><span class="c4">.</span><span class="c10 c9">table)</span></p><p class="c6"><span class="c13">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;</span><span class="c0">for</span><span class="c13">&nbsp;(a,p) </span><span class="c0">in</span><span class="c13">&nbsp;&#981;</span><span class="c4">.</span><span class="c10 c9">table</span></p><p class="c6"><span class="c13">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &#981;</span><span class="c4">.</span><span class="c13">table[a] </span><span class="c4">=</span><span class="c13">&nbsp;p</span><span class="c4">/</span><span class="c10 c9">z</span></p><p class="c6"><span class="c13">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;</span><span class="c0">end</span></p><p class="c6"><span class="c13">&nbsp; &nbsp;</span><span class="c0">return</span><span class="c10 c9">&nbsp;&#981;</span></p><p class="c15 c23"><span class="c0">end</span></p></td></tr></tbody></table><p class="c11"><span class="c5"></span></p><p class="c11"><span class="c5"></span></p><p class="c11"><span class="c5"></span></p><p class="c11"><span class="c5"></span></p><p class="c11"><span class="c5"></span></p><p class="c11"><span class="c5"></span></p><p class="c11"><span class="c5"></span></p><p class="c11"><span class="c5"></span></p><a id="t.034f9b2050216c72e95a3232da4cc2f0da7ca0c4"></a><a id="t.1"></a><table class="c18"><tbody><tr class="c20"><td class="c21" colspan="1" rowspan="1"><p class="c6"><span class="c0 c9">&#31684;&#20363;2.3 (&#38626;&#25955;&#32879;&#21512;&#27231;&#29575;&#20998;&#24067;&#23526;&#20316;&#65292;&#35531;&#25645;&#37197;&#19978;&#26041;2.1&#31243;&#24335;&#30908;)</span></p><p class="c6"><span class="c0 c9">&#22312;&#36889;&#20491;&#31684;&#20363;&#20013;&#65292;&#25105;&#20497;&#20197;&#34920;2.1&#20316;&#28858;&#23526;&#20363;&#12290;&#24213;&#19979;&#23637;&#31034;&#20102;&#21033;&#29992;2.1&#31243;&#24335;&#30908;&#25152;&#33258;&#23450;&#32681;&#30340;&#22411;&#21029;&#12300;Factor&#12301;&#65292;&#23559;&#34920;2.1&#23526;&#29694;&#22312;&#31243;&#24335;&#30908;&#20013;&#12290;</span></p><p class="c6"><span class="c0 c9">(&#35695;:&#26377;&#19977;&#20491;&#35722;&#25976;x,y and z&#65292;&#36889;&#19977;&#20491;&#35722;&#25976;&#36879;&#36942;variable&#23450;&#32681;&#20102;&#35722;&#25976;&#21517;&#31281;&#20197;&#21450;&#35442;&#35722;&#25976;&#20855;&#26377;2&#31278;&#21487;&#33021;&#30340;&#20540;&#65292;&#22312;&#36889;&#20491;&#20363;&#23376;&#20013;&#19977;&#20491;&#35722;&#25976;&#37117;&#26159;&#20108;&#20803;&#35722;&#25976;&#21482;&#26377;&#20841;&#31278;&#21487;&#33021;&#29376;&#24907;&#12290;&#34920;&#26684;2.1&#20013;&#30340;&#36039;&#35338;&#65292;&#23601;&#36879;&#36942;Fatctor&#23450;&#32681;&#28858;&#981; )</span></p><p class="c14 c15"><span class="c0 c9"></span></p><p class="c6"><span class="c0 c9">X = Variable(:x, 2) </span></p><p class="c6"><span class="c0 c9">Y = Variable(:y, 2) </span></p><p class="c6"><span class="c0 c9">Z = Variable(:z, 2) </span></p><p class="c6"><span class="c0 c9">&#981; = Factor([X, Y, Z], </span></p><p class="c3"><span class="c0 c9">FactorTable((x=1, y=1, z=1) =&gt; 0.08, (x=1, y=1, z=2) =&gt; 0.31, </span></p><p class="c3"><span class="c0 c9">(x=1, y=2, z=1) =&gt; 0.09, (x=1, y=2, z=2) =&gt; 0.37, </span></p><p class="c3"><span class="c0 c9">(x=2, y=1, z=1) =&gt; 0.01, (x=2, y=1, z=2) =&gt; 0.05, </span></p><p class="c3"><span class="c0 c9">(x=2, y=2, z=1) =&gt; 0.02, (x=2, y=2, z=2) =&gt; 0.07,)</span></p><p class="c3"><span class="c0">)</span></p></td></tr></tbody></table><p class="c11"><span class="c5"></span></p><p class="c11"><span class="c5"></span></p><p class="c11"><span class="c5"></span></p><p class="c23 c24"><span class="c0 c9"></span></p><p class="c14"><span class="c5"></span></p><p class="c14"><span class="c5"></span></p></body></html>